src/main/test/artillery/output_log.txt
Test run id: tfdt9_tfjdffj8j6mhhxy8ewaczmxg7b5ax_arxn
Phase started: simple_get (index: 0, duration: 25s) 19:18:00(+0000)

Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user1 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user2 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user3 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user4 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user5 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user6 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user7 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user8 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user9 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user10 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user11 

  ok statusCode 200 
--------------------------------------
Metrics for period to: 19:18:10(+0000) (width: 8.045s)
--------------------------------------

http.codes.200: ................................................................ 18
http.downloaded_bytes: ......................................................... 774
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 18
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 22
  mean: ........................................................................ 8
  median: ...................................................................... 7.9
  p95: ......................................................................... 16
  p99: ......................................................................... 16
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 22
  mean: ........................................................................ 8
  median: ...................................................................... 7.9
  p95: ......................................................................... 16
  p99: ......................................................................... 16
http.responses: ................................................................ 18
plugins.expect.ok: ............................................................. 9
plugins.expect.ok.statusCode: .................................................. 9
plugins.metrics-by-endpoint./tukano/rest/users/login.codes.200: ................ 9
plugins.metrics-by-endpoint./tukano/rest/users/{{ userId }}.codes.200: ......... 9
plugins.metrics-by-endpoint.response_time./tukano/rest/users/login:
  min: ......................................................................... 2
  max: ......................................................................... 8
  mean: ........................................................................ 3.9
  median: ...................................................................... 4
  p95: ......................................................................... 4
  p99: ......................................................................... 4
plugins.metrics-by-endpoint.response_time./tukano/rest/users/{{ userId }}:
  min: ......................................................................... 9
  max: ......................................................................... 22
  mean: ........................................................................ 12.1
  median: ...................................................................... 10.1
  p95: ......................................................................... 16
  p99: ......................................................................... 16
vusers.completed: .............................................................. 9
vusers.created: ................................................................ 9
vusers.created_by_name.TuKanoHome: ............................................. 9
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 19.5
  max: ......................................................................... 62.9
  mean: ........................................................................ 28.8
  median: ...................................................................... 22
  p95: ......................................................................... 46.1
  p99: ......................................................................... 46.1


Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user12 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user13 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user14 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user15 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user16 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user17 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user18 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user19 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user20 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user21 

  ok statusCode 200 
--------------------------------------
Metrics for period to: 19:18:20(+0000) (width: 9.009s)
--------------------------------------

http.codes.200: ................................................................ 20
http.downloaded_bytes: ......................................................... 918
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 20
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 17
  mean: ........................................................................ 8.1
  median: ...................................................................... 6
  p95: ......................................................................... 16
  p99: ......................................................................... 16
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 17
  mean: ........................................................................ 8.1
  median: ...................................................................... 6
  p95: ......................................................................... 16
  p99: ......................................................................... 16
http.responses: ................................................................ 20
plugins.expect.ok: ............................................................. 10
plugins.expect.ok.statusCode: .................................................. 10
plugins.metrics-by-endpoint./tukano/rest/users/login.codes.200: ................ 10
plugins.metrics-by-endpoint./tukano/rest/users/{{ userId }}.codes.200: ......... 10
plugins.metrics-by-endpoint.response_time./tukano/rest/users/login:
  min: ......................................................................... 2
  max: ......................................................................... 6
  mean: ........................................................................ 4.1
  median: ...................................................................... 4
  p95: ......................................................................... 6
  p99: ......................................................................... 6
plugins.metrics-by-endpoint.response_time./tukano/rest/users/{{ userId }}:
  min: ......................................................................... 8
  max: ......................................................................... 17
  mean: ........................................................................ 12.1
  median: ...................................................................... 10.9
  p95: ......................................................................... 16
  p99: ......................................................................... 16
vusers.completed: .............................................................. 10
vusers.created: ................................................................ 10
vusers.created_by_name.TuKanoHome: ............................................. 10
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 16.4
  max: ......................................................................... 36
  mean: ........................................................................ 24.5
  median: ...................................................................... 20.7
  p95: ......................................................................... 34.8
  p99: ......................................................................... 34.8


Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user22 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user23 

  ok statusCode 200 
Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user24 

  ok statusCode 200 
Phase completed: simple_get (index: 0, duration: 25s) 19:18:25(+0000)

Login successful, proceeding to fetch user data.
* DELETE /tukano/rest/users/user25 

  ok statusCode 200 
--------------------------------------
Metrics for period to: 19:18:30(+0000) (width: 5.039s)
--------------------------------------

http.codes.200: ................................................................ 12
http.downloaded_bytes: ......................................................... 570
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 12
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 28
  mean: ........................................................................ 11.6
  median: ...................................................................... 7
  p95: ......................................................................... 19.1
  p99: ......................................................................... 19.1
http.response_time.2xx:
  min: ......................................................................... 4
  max: ......................................................................... 28
  mean: ........................................................................ 11.6
  median: ...................................................................... 7
  p95: ......................................................................... 19.1
  p99: ......................................................................... 19.1
http.responses: ................................................................ 12
plugins.expect.ok: ............................................................. 6
plugins.expect.ok.statusCode: .................................................. 6
plugins.metrics-by-endpoint./tukano/rest/users/login.codes.200: ................ 6
plugins.metrics-by-endpoint./tukano/rest/users/{{ userId }}.codes.200: ......... 6
plugins.metrics-by-endpoint.response_time./tukano/rest/users/login:
  min: ......................................................................... 4
  max: ......................................................................... 7
  mean: ........................................................................ 5
  median: ...................................................................... 5
  p95: ......................................................................... 5
  p99: ......................................................................... 5
plugins.metrics-by-endpoint.response_time./tukano/rest/users/{{ userId }}:
  min: ......................................................................... 14
  max: ......................................................................... 28
  mean: ........................................................................ 18.2
  median: ...................................................................... 15
  p95: ......................................................................... 19.1
  p99: ......................................................................... 19.1
vusers.completed: .............................................................. 6
vusers.created: ................................................................ 6
vusers.created_by_name.TuKanoHome: ............................................. 6
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 22.7
  max: ......................................................................... 39.8
  mean: ........................................................................ 31.4
  median: ...................................................................... 27.9
  p95: ......................................................................... 40
  p99: ......................................................................... 40


All VUs finished. Total time: 26 seconds

--------------------------------
Summary report @ 19:18:27(+0000)
--------------------------------

http.codes.200: ................................................................ 50
http.downloaded_bytes: ......................................................... 2262
http.request_rate: ............................................................. 2/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 28
  mean: ........................................................................ 8.9
  median: ...................................................................... 7.9
  p95: ......................................................................... 19.1
  p99: ......................................................................... 22
http.response_time.2xx:
  min: ......................................................................... 2
  max: ......................................................................... 28
  mean: ........................................................................ 8.9
  median: ...................................................................... 7.9
  p95: ......................................................................... 19.1
  p99: ......................................................................... 22
http.responses: ................................................................ 50
plugins.expect.ok: ............................................................. 25
plugins.expect.ok.statusCode: .................................................. 25
plugins.metrics-by-endpoint./tukano/rest/users/login.codes.200: ................ 25
plugins.metrics-by-endpoint./tukano/rest/users/{{ userId }}.codes.200: ......... 25
plugins.metrics-by-endpoint.response_time./tukano/rest/users/login:
  min: ......................................................................... 2
  max: ......................................................................... 8
  mean: ........................................................................ 4.2
  median: ...................................................................... 4
  p95: ......................................................................... 6
  p99: ......................................................................... 7
plugins.metrics-by-endpoint.response_time./tukano/rest/users/{{ userId }}:
  min: ......................................................................... 8
  max: ......................................................................... 28
  mean: ........................................................................ 13.6
  median: ...................................................................... 12.1
  p95: ......................................................................... 19.1
  p99: ......................................................................... 22
vusers.completed: .............................................................. 25
vusers.created: ................................................................ 25
vusers.created_by_name.TuKanoHome: ............................................. 25
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 16.4
  max: ......................................................................... 62.9
  mean: ........................................................................ 27.7
  median: ...................................................................... 22.9
  p95: ......................................................................... 40
  p99: ......................................................................... 46.1